pets = {}
pets1 = {}
while (True):
    s = input("Имя питомца:")
    if s == "":
        break
    else:
        s1 = input("Вид питомца: ")
        s2 = int(input("Возраст питомца: "))
        let = ""
        if s2 % 10 <= 4 and s2 != 12 and s2 != 13 and s2 != 14:
            let = "года"
        else:
            let = "лет"
        s3 = input("Имя владельца: ")
pets1 = {"Вид питомца:" : s1, "Возраст питомца:" : s2, "Имя владельца:" : s3}
pets[s] = pets1
print("Это", pets1["Вид питомца:"], "по кличке", pets.keys(), ". Возраст питомца:", pets1["Возраст питомца:"], let, "Имя владельца:", pets1["Имя владельца:"])